{
  "id": "activity-5",
  "title": "Prudence: The Power of Holding Back",
  "description": "Reflect on the concept of prudence — holding back, pausing, and choosing wiser responses — and practice expressing personal insights through discussion questions.",
  "activityContext": "Have you ever said something you wish you hadn\\'t? Acted in a way that made you feel a bit unbalanced? Or made a decision that didn\\'t go your way?\\nAnd after those moments — the words you regret, the actions that left you uneasy, the decisions that didn\\'t quite land — you may have felt a strange discomfort, like something inside you was unsettled. That quiet voice in your mind, the one that stirs when something feels off — that\\'s your conscience.\\nBelieve it or not, that voice exists to guide us. It tells us when we\\'ve crossed a line or when we could have done better. But here\\'s the real question: Can we shut it down? Can we just ignore that inner discomfort and live without the weight of emotional aftermath?\\nUnfortunately, that inner voice — the one that questions and reminds — will never completely go away. But here\\'s the good news: it can be managed. It takes a bit of practice, but it\\'s absolutely within your reach.\\nLet me give you an example: Have you ever held your tongue when you really wanted to give your opinion about something? That exact moment — when you\\'re burning to speak your mind — is the key moment to practice prudence. It\\'s when you have a choice: to say what you feel or to pause and think before crossing a line.\\n It\\'s not easy to hold back, is it?\\nPrudence doesn\\'t mean staying silent forever or avoiding every tough situation. It means being wise enough to choose the right words, the right timing, and the right attitude. It\\'s what helps you act — not just react.\\n You just need to stay aware: a comment thrown in anger, a rushed decision, or a careless judgment can do real damage.\\n When that wave of burning emotional reaction builds inside you — whether it\\'s anger, pride, anxiety, or something else — take a moment. Pause mentally. Let the first impulse pass before you choose your next move — which will likely be the wiser one.\\nThere\\'s usually a quick internal reaction when you\\'re about to speak or act, and it comes with two options: the first is what you emotionally want to say — the raw, unfiltered version. The second is a more intentional response — one that takes a moment to consider the weight, the impact, and the intention behind what you\\'re about to express.\\nPrudence won\\'t make you the loudest voice in the room — but it might make you the one people remember when the noise dies down.\\n It\\'s not weakness. It\\'s not fear. It\\'s the strength to delay the explosion, to ask yourself what kind of echo you want your words and actions to leave behind. In a world addicted to reaction, prudence is a quiet form of rebellion — the kind that builds character instead of chaos.\\nSo next time you\\'re at the edge of speaking too soon or acting too fast, don\\'t just hold back — take command.\\n Because real power isn\\'t in doing what feels good in the moment — it\\'s in knowing you could act on impulse, and choosing to rise above it.\\nWhat are some areas of your life where you could start practicing prudence today?",
  "level": "B2",
  "questions": [
    {
      "id": "q1",
      "type": "text",
      "question": "What are the most important key points the text expresses, and why do you think they matter? Explain the points.",
      "hint": "Think about conscience, impulse, and the value of pausing before reacting.",
      "evaluatePoints": [
        "Identifies at least 2–3 key points from the text",
        "Explains why they matter",
        "Uses clear reasoning"
      ]
    },
    {
      "id": "q2",
      "type": "text",
      "question": "Is it easier to be imprudent than to be prudent? Why do you think that is? Do you agree or disagree? Explain your reasoning.",
      "hint": "Compare acting on impulse vs. pausing to reflect.",
      "evaluatePoints": [
        "Takes a clear position",
        "Supports with explanation",
        "Shows awareness of self-control"
      ]
    },
    {
      "id": "q3",
      "type": "text",
      "question": "When others let their 'demons' speak, how do you typically respond — defend, withdraw, attack, or pause? Explain.",
      "hint": "Think about your usual reactions in heated situations.",
      "evaluatePoints": [
        "Describes personal reaction style",
        "Gives an example or explanation",
        "Shows self-reflection"
      ]
    },
    {
      "id": "q4",
      "type": "text",
      "question": "What situations tend to trigger strong emotional reactions in you? How do you usually respond?",
      "hint": "Consider stress, conflict, or personal challenges.",
      "evaluatePoints": [
        "Identifies personal triggers",
        "Explains typical reactions",
        "Shows awareness of patterns"
      ]
    },
    {
      "id": "q5",
      "type": "text",
      "question": "In your opinion, is holding back always the right choice? How do you know when to speak up or act and when to hold back?",
      "hint": "Think about balance: prudence vs. silence.",
      "evaluatePoints": [
        "Explores pros and cons",
        "Provides reasoning",
        "Shows critical thinking"
      ]
    },
    {
      "id": "q6",
      "type": "text",
      "question": "Is it always possible to pause and choose your reaction, even in high-stress situations? How? Why or why not?",
      "hint": "Reflect on self-control under pressure.",
      "evaluatePoints": [
        "Takes a clear stance",
        "Gives reasoning or examples",
        "Acknowledges limits or strategies"
      ]
    },
    {
      "id": "q7",
      "type": "text",
      "question": "In what areas of your life (work, family, social media, personal conflict) do you struggle most to be prudent? Explain why.",
      "hint": "Think about everyday contexts where you face challenges.",
      "evaluatePoints": [
        "Identifies context(s)",
        "Explains challenges",
        "Shows personal insight"
      ]
    },
    {
      "id": "q8",
      "type": "text",
      "question": "Do you think your conscience is more of a guide, a critic, or a burden? Why?",
      "hint": "Reflect on how you experience your inner voice.",
      "evaluatePoints": [
        "Chooses one perspective",
        "Supports with reasoning",
        "Shows reflection on conscience"
      ]
    },
    {
      "id": "q9",
      "type": "text",
      "question": "If you had to teach one younger person the value of prudence, what story or example from your life would you share?",
      "hint": "Think of a time you learned to hold back or act wisely.",
      "evaluatePoints": [
        "Provides personal example",
        "Connects to prudence",
        "Shows ability to teach a lesson"
      ]
    }
  ],
  "metadata": {
    "duration": 20,
    "difficulty": "upper-intermediate",
    "tags": ["prudence", "self-control", "reflection", "values", "B2"]
  }
}
